app/Controllers/Auth.php

SELECT *
FROM `tbl_user`
WHERE `username` = 'abere'
 LIMIT 1
---
    public function loginProcess()
    {
        $model = new M_User();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');
        $user = $model->where('username', $username)->first();