app/Controllers/Dashboard.php

    public function index()
    {
        $produtu = new M_Produtu();
        $kostumer = new M_Kostumer();
        $vendas_item = new M_Vendas_item();
        $fornesedor = new M_Fornesedor();

        $data = [
            'total_produtu'   => $produtu->countAllResults(),
            'total_kostumer'     => $kostumer->countAllResults(),
            'total_vendas_item' => $vendas_item->countAllResults(),
            'total_fornesedor' => $fornesedor->countAllResults(),
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_produtu`
SELECT COUNT(*) AS `numrows`
FROM `tbl_kostumer`
SELECT COUNT(*) AS `numrows`
FROM `tbl_vendas_item`
SELECT COUNT(*) AS `numrows`
FROM `tbl_fornesedor`