app/Controllers/Fornesedor.php

SELECT *
FROM `tbl_fornesedor`
---
    public function index()
    {

        $data['fornesedor'] = $this->fornesedor->findAll();