app/Controllers/Home.php

SELECT *
FROM `tbl_produtu`
---
    public function index()
    {
        $model = new M_Produtu();

        // NAMA VARIABEL HARUS "produtu"
        $data['produtu'] = $model->findAll();